import React, { useState } from 'react';
import Head from 'next/head';
import Link from 'next/link';

import PoemCard from '@/components/poem/card.component';
import Main from '@/components/layouts/main/main.component';

import styles from '@/styles/pages/poems.module.scss';

import { Newline } from '@/utils/helper';
import classNames from 'classnames';
import {BsChevronLeft} from 'react-icons/bs';

const Poem = () =>
{
    const [item, setItem] = useState<number[]>([]);

    const handleItem = (index: number) =>
    {
        let newItem = item;

        if (newItem.includes(index))
            newItem = newItem.filter((newIndex: number) => newIndex !== index);
        else
            newItem.push(index);

        setItem([...newItem]);
    };

    return (
        <>
            <Head>
                <title>وبسایت اختصاصی حافظ شیرازی معروف ترین غزل سرای ایران</title>
                <meta charSet='UTF-8' />
                <meta content='width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0' name='viewport' />
                <meta content="ie=edge" httpEquiv='X-UA-Compatible' />
            </Head>

            <Main>
                <section className={styles.poemHeader}>
                    <h1>
                        غزل شماره 1 از دیوان غزلیات حافظ شیرازی
                    </h1>
                    <article>
                        <Newline content={'خدا چو صورت ابروی دلگشای تو بست\nگشاد کار من اندر کرشمه‌های تو بست\nمرا و سرو چمن را به خاک راه نشاند\nزمانه تا قصب نرگس قبای تو بست\nز کار ما و دل غنچه صد گره بگشود\nنسیم گل چو دل اندر پی هوای تو بست\nمرا به بند تو دوران چرخ راضی کرد\nولی چه سود که سررشته در رضای تو بست\nچو نافه بر دل مسکین من گره مفکن\nکه عهد با سر زلف گره گشای تو بست\nتو خود وصال دگر بودی ای نسیم وصال\nخطا نگر که دل امید در وفای تو بست\nز دست جور تو گفتم ز شهر خواهم رفت\nبه خنده گفت که حافظ برو که پای تو بست'} />
                    </article>
                    <div className={classNames(styles.poemItem, { [styles.poemItemActive]: item.includes(0) })} onClick={() => handleItem(0)}>
                        <header>
                            <h2>
                                نقش دستوری تمامی کلمات غزل شماره 1 دیوان اشعار حافظ شیرازی
                            </h2>
                            <i>
                                <BsChevronLeft />
                            </i>
                        </header>
                        <div>
                            <Newline content={'اَلا: حرف استفتاح که افادهِ تأکید و تنبیه به مخاطب (ساقی) را دارد.\nیا: اِی، حرف ندا.\nاَیُّ: منادای مفرد.\nها: هاء، حرف تنبیه، مضافٌ الیهِ اَیُّ.\nالسّاقی: سقّا، کسی که آب می آشاماند و در مجلس شراب: کسی که شراب می دهد و در اشعار حافظ بار کلمات یار، معشوق، جانان، همدم، حریف، محبوب را به عهده می گیرد و در اصطلاح عرفا به معنای معشوق ازلی است.\nاَدِر: بگردان، به گردش درآور.\nکأس: کاسه، قدح، پیاله یی که از شراب پُر باشد.\nناوِلها: ناولیها، بیاشامان (کاسه و قدح را به ما بیاشامان)\nکه: حرف ربط تعلیل که برای صیغه امر در مصراع اول علّت را بیان می کند.\nعشق: محبّت مفرط، بسیار دوست داشتن و در اصطلاح عرفان جمیع کمالات را گویند که در یک ذات باشد.\nنمود: نمایش داد، به نظر آمد.\nنافه: کیسه و غلاف غدّه ای که در زیر شکم نوعی از آهوان نَرِ ختن از ولایت خَتا موجود است و مادّه مترشّحه آن که نتیجه پاره یی تغییرات در ماهیت خون است معطّر بوده و به نام مشک موسوم است.\nکاخِر: که آخِر: قید زمان، عاقبت و سرانجام.\nصبا: نسیم ملایمی که در اوایل بهار و پاییز از جانب شمال شرقی می وزد.\nطُرّه: نَرده چوبی که برای محافظت در جلو ایوان نصب می کنند و به صورت استوانه های باریک چوبی عمودی با فواصل مساوی است و کِنایتاً به موهایی که از ناحیه بالای پیشانی تا بالای ابرو در پیشانی شانه زده و در زیر ابرو به خط افقی به چینند، (پیش زلفی) گفته می شود.\nتاب: چین و شکن، پیچش.\nجَعد: به هم پیچیده، موی تاب دار.\nتابِ جَعدِ مشکین: در اصطلاح عرفا به راه پرپیچ و خمی که سالک در پیش رو دارد گفته می شود.\nمرا: برای من.\nمنزل: جایگاه نزول مسافر در راه برای استراحت.\nجانان:1- به معناي يار-معشوق-همدم-محبوب\n2- استثنائا دراين بيت به معناي جمع جان و کنایتاً محبوبان، معشوقان، جانهایی دوست داشتنی است.\nاَمنِ عیش: آسایش زندگانی، آسوده زیستن، در امن و امان زیستن.\nجَرَس: زنگِ صداداری که به گردن حیوان پیش آهنگ قافله بسته می شد و زنگ صدادار بزرگی که مکاریها و قافله سالاران برای بیدار و سوار شدن مسافرین به صدا در می آوردند.\nفریاد: صدای رسا و بلند برای کمک طلبیدن و یا آگاهی دادن.\nبربندید: به بالا به بندید و کنایه از بستن محمل بر پشت چارپایان است.\nمَحمِل ها: بارها، و در اینجا اشاره به کجاوه و پالکی و صندوقچه چوبی مکعبی سر بازی است که به دو طرف چارپایان بسته و مسافر در آن می نشسته است.\nسجّاده: جای سجده نماز، پارچه طاهری که بر روی آن نماز یا بر آن سجده کنند.\nپیر: مرد سپیدمو و مُسِن.\nپیر مغان: پیر متصدّی آتش در آتشکده، پیر مِی فروش مُغ ها و مجوسی ها.\nسالک: پوینده راه و رفتار و در اصطلاح عارفان به رونده راهی گفته می شود که به حق و حقیقت منتهی می شود.\nهایل: هولناک، ترسناک.\nخودکامی: خودکامگی، به کسی که در همه امور به میل و دلخواه خود عمل کرده و بی اعتنا به دستورات عقلی و تجربی باشد، گفته می شود.\nحضور: مقابل غیبت، بودن در زمان معینی و در مکان معین و در اصطلاح عرفا بودن در پیشگاه مراد و آماده بودن ذهن در هر لحظه برای درک اسرار مطروحه و غیبت معنای نفی آن را افاده می کند و در اینجا کنایتاً به معنای آسایش و راحتی است.\nمَتی: هرگاه، چون.\nما: حرف زاید.\nتَلق: ملاقات کنی.\nمَن: کسی که.\nتَهوی: آرزویش داری، دوست می داری.\nدَع: وداع کن، ترک کن.\nدنیا: جهان.\nاَهمِل: واگذار کن، رها کن.'} />
                        </div>
                    </div>
                    <div className={classNames(styles.poemItem, { [styles.poemItemActive]: item.includes(1) })} onClick={() => handleItem(1)}>
                        <header>
                            <h2>
                                معنی کامل غزل شماره 1 دیوان اشعار حافظ شیرازی
                            </h2>
                            <i>
                                <BsChevronLeft />
                            </i>
                        </header>
                        <div>
                            <Newline content={'(1)آهای! ای ساقی! جام شراب را بِگردان و به من بیاشامان چرا که عشق، در ابتدا آسان جلوه کرد اما برای من مشکل هايی در پی داشت.\n(2)در آرزوی بوییدن بوی خوشی که نسیم صبا در اثر گشودن زلف مشکین او پراکنده می سازد، چه خون دل خوردن هایی نصیب من شد!\n(3)در این منزل و در کنار یاران جانی و دوست داشتنی برای من چه جای خوش گذرانی است؟ حال آنکه زنگِ هُشدارِ قافله هر دم، ما را به بارگیری و حرکت فرا می خواند.\n(4)هرگاه پیر و سالک راه حقّ به تو امر کند که سجّاده نمازت را به شراب بیالای، امر او را اطاعت کن زیرا او به پیچ و خمهای راه وصول به حقّ آگاهی دارد.\n(5)در این شب تاریک و در میان گردابی هولناک و ترس از امواج، آنها که این راه را سپری کرده و در کنار ساحل در حال آسایشند از حال ما بی خبرند.\n(6)عاقبت در اثر عدم پیروی از پیران طریقت و در اثر خودسری به ورطه بدنامی افتادم و این رازی را که در هر محفلی بازگو می شود چگونه می توان پنهان نگه داشت؟\n(7)ای حافظ! اگر مایلی در حضور پیر طریقت از اسرار حقیقت آگاه شوی منکر دستورات او مشو و چون به ملاقات و دیدار محبوب خود رسیدی دنیا و مافیها را به حال خود رها کن.'} />
                        </div>
                    </div>
                    <div className={classNames(styles.poemItem, { [styles.poemItemActive]: item.includes(2) })} onClick={() => handleItem(2)}>
                        <header>
                            <h2>
                                شرح و تفسیر غزل شماره 1 دیوان اشعار حافظ شیرازی
                            </h2>
                            <i>
                                <BsChevronLeft />
                            </i>
                        </header>
                        <div>
                            <Newline content={'\nبحر غزل: هَزَج مثمّن سالم\n*\n1-گردآورنده اشعار حافظ (محمد گلندام) که برای اولین بار غزلهای شاعر را از روی حروف الفبا مرتب کرده است شاید به سبب شهرت همه گیر این غزل و اشارات عرفانی که از ابیات آن مستفاد می شده و در نتیجه طرفدارانی داشته و اینکه حافظ از دست دشمنان و حاسدان و متولیان دروغین شریعت عمری را در معرض تهمت و کارشکنی و بالنتیجه در رنج و عذاب به سر می برده و ابیات این غزل تلویحاً تعبیراتی از کارنامه زندگانی پر دردسر خود او بوده است آن را در سر فصل غزلهای با حرف (الف) قرار داده وگرنه به علت حرف (ه) ماقبل (الف) موجود در کلمه قافیه می بایستی در پایان غزلهای حرف (الف) جای گیرد.\n\n2-دشمنی معاندین پس از ارتحال شاعر نیز ادامه داشت چنانکه بر سر دفن او و خواندن نماز بر پیکر مطهرش منازعه شد، گویی دست سرنوشت می خواست پایان کار او را همانند دفن فردوسی علیه الرّحمه درآورده تا برای آیندگان دلیلی باشد که بدانند چگونه قشریون پیش پابین در پی بریدن دستهایی که آخرالامر مجبور به بوسیدن آن شدند چه تلاشهای رذیلانه یی به خرج داده اند! اما امروزه کسی نام آنها و کسانی را که کتاب مثنوی شریف را با انبر (نه با دست) گرفته و در مزبله می انداختند نمی داند حال آنکه نام فردوسی و مولوی و حافظ گوش همه خاکیان و هوش تمام افلاکیان را پر و تسخیر کرده است. اجمالاً کار دشمنی پس از مرگ حافظ به جایی رسید که برای جلوگیری از اشاعه روزافزون اشعار او که به منزله خاری در چشم معاندین بود متوسّل به حیله تهمت و افترا شده چنین شایع کردند که این کتاب به جای آنکه در مقدّمه با نام خدا و نَعت حضرت ختمی مرتبت زینت یابد با تضمین بیتی از یزید بن معاویه شروع شده است.\nمرحوم علامه قزوینی در این باره در شماره 5 و 6 مجله یادگار پس از درج نوشته (سودی) که برای اولین مرتبه در کتاب شرح حافظ خود به بیان این مطلب پرداخته، همچنین با ذکر شعر منسوب به اهلی شیرازی و کاتبی نیشابوری در تعریض بر حافظ در این باره، می نویسد: «این حکایت فوق العاده واهی و سخیف و عامیانه است و تقریباً به نحو قطع و یقین می توان گفت که به کلی مجعول و ساختگی است.» آنگاه نام بیش از سی جلد کتاب متون عربی و اسناد و مآخذ تاریخی عرب و دوازده کتاب تذکرده و سند اصیل را برشمرده و می نویسد که: «تمام این کتابها را زیر و رو کردم و مطلقاً و اصلاً به هیچ وجه مِنَ الوجوه از این دو بیت عربی منسوب به یزید در هیچ جا نشانه و اثری و خبری نیافتم.» و با دلیل متقن جَعلی بودن اشعار اهلی و کاتبی را نیز مدلّل می دارند و در خاتمه می نویسند: «من احتمال بسیار قوی می دهم که دو بیت مصنوعی منسوب به یزید:\nانا المسموم ما عندی \nبه تریاق و لاراقی\nادرکأساً و ناولها\nالا یا ایّها السّاقی\n\nهم از حیث وزن و هم از حیث قافیه و هم از حیث مضامین و طرز ادا و هم بالاخره از حیث استعمال بعضی از عین همان تعبیرات و کلمات از روی غزل ملمّع سعدی در بدایع ساخته شده ...».\nبعضی از ابیات غزل سعدی از قرار ذیل است:\nبه پایان آمد این دفتر حکایت همچنان باقی\nبه صد دفتر نشاید کرد حسب الحال مشتاقی\nقُم املأ و اَسقِنی کأساً و دَع مافیه مسموماً\nاَما انتَ الّذی تسقی فعین السمّ تریاقی\n\nکه کلمات به کار گرفته شده در ابیات سعدی و بعضاً عین همان الفاظ و تعبیرات در بیت منسوب به یزید است. و ماحصل کلام آنکه حافظ از مضامین و تعبیرات غزل ملمّع سعدی متأثّر و بیت مشهور: الا یا ایّها السّاقی ... را سروده و به یزید نسبتی ندارد.\n\n3-این غزل احتمالاً در اواخر سال 767 هجری یعنی موقعی که شاه محمود برادر شاه شجاع شیراز را در تصرّف خود داشت و شاه شجاع پس از دو سال دوری از شیراز عزم حمله و تسخیر آن را داشته و در بیرون دروازه شهر مقدّمات حمله به شیراز را تهیّه می دید سروده شده است و در این فرجه زمانی چندین غزل دیگر نیز توسط حافظ سروده شده که به موقع خود در شرح آن غزلها خواهد آمد. در این غزل ابهاماتی وجود دارد که این احتمال را تقویت می کند:\n\nالف) در بیت دوم اخبار متواتر و شایعه های امیدوار کننده مبنی بر حمله قریب الوقوع شاه شجاع به شیراز و حالت انتظار شاعر را بازگو می کند.\nب) در بیت سوم شاعر از عدم امنیت خود در شهری که فعلاً شاه محمود بر آن مسلّط است و قبلاً (منزل جانان) یعنی در تصرّف شاه شجاع بوده سخن می راند.\nج) در بیت چهارم تشجیع شاه شجاع از طرف حافظ و اینکه من که قریب به پانزده سال از تو بزرگتر هستم و با تجربه تر و از احوال و اوضاع داخل شهر مطّلعم پیشنهاد حمله سریع به شهر را می کنم.\nد) در بیت پنجم حالت بیم و هراس خود را بیان داشته و می گوید آنها که در حال حاضر دور از شیراز و تسلّط شاه محمود هستند نمی توانند به میزان گرفتاری ما پی ببرند.\nه) در بیت ششم با یادآوری این نکته که حافظ از طرفداران شناخته شده شاه شجاع بوده و در زمان حکومت موقّت شاه محمود متّهم و تحقیر می شود شمّه یی بیان می دارد و می گوید البته این امر چیزی نبود که بشود پنهان کرد و همه می دانستند که من طرفدار شاه شجاع هستم.\nو) در بیت هفتم یعنی در مقطع غزل شاعر خود را امیدوار به پیروزی و ملاقات شاه شجاع می کند.\n\n4-در پایان شرح این غزل باید به این نکته اشاره کرد که شاعر مضمون بیت پنجم غزل را که شاه بیت آن هم به حساب می آید، از همام تبریزی گرفته که می گوید:\nگر ملامتگر نداند حال ما عیبش مکن \nما میان موج دریائیم و او بر ساحل است\nو همام تبریزی نیز از سعدی استقبال کرده است. سعدی می فرماید:\nای برادر ما به گرداب اندریم \nوآنکه شنعت می کند بر ساحل است \nو با مطالعه این سه بیت می توان به خوبی دریافت که حافظ در عالی ترین سطح بلاغت مضمون را پرورش داده است.'} />
                        </div>
                    </div>
                    <div className={classNames(styles.poemItem, { [styles.poemItemActive]: item.includes(3) })} onClick={() => handleItem(3)}>
                        <header>
                            <h2>
                                پند و درک مطلب غزل شماره 1 دیوان اشعار حافظ شیرازی
                            </h2>
                            <i>
                                <BsChevronLeft />
                            </i>
                        </header>
                        <div>
                            <Newline content={'اَلا: حرف استفتاح که افادهِ تأکید و تنبیه به مخاطب (ساقی) را دارد.\nیا: اِی، حرف ندا.\nاَیُّ: منادای مفرد.\nها: هاء، حرف تنبیه، مضافٌ الیهِ اَیُّ.\nالسّاقی: سقّا، کسی که آب می آشاماند و در مجلس شراب: کسی که شراب می دهد و در اشعار حافظ بار کلمات یار، معشوق، جانان، همدم، حریف، محبوب را به عهده می گیرد و در اصطلاح عرفا به معنای معشوق ازلی است.\nاَدِر: بگردان، به گردش درآور.\nکأس: کاسه، قدح، پیاله یی که از شراب پُر باشد.\nناوِلها: ناولیها، بیاشامان (کاسه و قدح را به ما بیاشامان)\nکه: حرف ربط تعلیل که برای صیغه امر در مصراع اول علّت را بیان می کند.\nعشق: محبّت مفرط، بسیار دوست داشتن و در اصطلاح عرفان جمیع کمالات را گویند که در یک ذات باشد.\nنمود: نمایش داد، به نظر آمد.\nنافه: کیسه و غلاف غدّه ای که در زیر شکم نوعی از آهوان نَرِ ختن از ولایت خَتا موجود است و مادّه مترشّحه آن که نتیجه پاره یی تغییرات در ماهیت خون است معطّر بوده و به نام مشک موسوم است.\nکاخِر: که آخِر: قید زمان، عاقبت و سرانجام.\nصبا: نسیم ملایمی که در اوایل بهار و پاییز از جانب شمال شرقی می وزد.\nطُرّه: نَرده چوبی که برای محافظت در جلو ایوان نصب می کنند و به صورت استوانه های باریک چوبی عمودی با فواصل مساوی است و کِنایتاً به موهایی که از ناحیه بالای پیشانی تا بالای ابرو در پیشانی شانه زده و در زیر ابرو به خط افقی به چینند، (پیش زلفی) گفته می شود.\nتاب: چین و شکن، پیچش.\nجَعد: به هم پیچیده، موی تاب دار.\nتابِ جَعدِ مشکین: در اصطلاح عرفا به راه پرپیچ و خمی که سالک در پیش رو دارد گفته می شود.\nمرا: برای من.\nمنزل: جایگاه نزول مسافر در راه برای استراحت.\nجانان:1- به معناي يار-معشوق-همدم-محبوب\n2- استثنائا دراين بيت به معناي جمع جان و کنایتاً محبوبان، معشوقان، جانهایی دوست داشتنی است.\nاَمنِ عیش: آسایش زندگانی، آسوده زیستن، در امن و امان زیستن.\nجَرَس: زنگِ صداداری که به گردن حیوان پیش آهنگ قافله بسته می شد و زنگ صدادار بزرگی که مکاریها و قافله سالاران برای بیدار و سوار شدن مسافرین به صدا در می آوردند.\nفریاد: صدای رسا و بلند برای کمک طلبیدن و یا آگاهی دادن.\nبربندید: به بالا به بندید و کنایه از بستن محمل بر پشت چارپایان است.\nمَحمِل ها: بارها، و در اینجا اشاره به کجاوه و پالکی و صندوقچه چوبی مکعبی سر بازی است که به دو طرف چارپایان بسته و مسافر در آن می نشسته است.\nسجّاده: جای سجده نماز، پارچه طاهری که بر روی آن نماز یا بر آن سجده کنند.\nپیر: مرد سپیدمو و مُسِن.\nپیر مغان: پیر متصدّی آتش در آتشکده، پیر مِی فروش مُغ ها و مجوسی ها.\nسالک: پوینده راه و رفتار و در اصطلاح عارفان به رونده راهی گفته می شود که به حق و حقیقت منتهی می شود.\nهایل: هولناک، ترسناک.\nخودکامی: خودکامگی، به کسی که در همه امور به میل و دلخواه خود عمل کرده و بی اعتنا به دستورات عقلی و تجربی باشد، گفته می شود.\nحضور: مقابل غیبت، بودن در زمان معینی و در مکان معین و در اصطلاح عرفا بودن در پیشگاه مراد و آماده بودن ذهن در هر لحظه برای درک اسرار مطروحه و غیبت معنای نفی آن را افاده می کند و در اینجا کنایتاً به معنای آسایش و راحتی است.\nمَتی: هرگاه، چون.\nما: حرف زاید.\nتَلق: ملاقات کنی.\nمَن: کسی که.\nتَهوی: آرزویش داری، دوست می داری.\nدَع: وداع کن، ترک کن.\nدنیا: جهان.\nاَهمِل: واگذار کن، رها کن.'} />
                        </div>
                    </div>
                </section>

                <h2 className={styles.poemsListHeader}>
                    از دیگر غزلیات حافظ
                </h2>
                <section className={styles.poemsList}>
                    <PoemCard />
                    <PoemCard />
                    <PoemCard />
                </section>
            </Main>
        </>
    );
};

export default Poem;
